app/views/maps/index.html.erb

SELECT "polygons".* FROM "polygons"
SELECT COUNT(*) FROM "polygons"
---
        // Mouseover - mostrar informações
        polygon.addListener('mouseover', function(e) {
            const contentString = `
        <div class="polygon-info-window">
          <h4>${polygonData.name}</h4>
          <p><strong>Descrição:</strong> ${polygonData.description}</p>
          <p><strong>Pontos:</strong> ${polygonData.coordinates.length}</p>
          <p><strong>Criado:</strong> ${polygonData.created_at}</p>
        </div>
      `;

            infoWindow.setContent(contentString);
            infoWindow.setPosition(e.latLng);
            infoWindow.open(map);
        });