app/controllers/maps_controller.rb

SELECT "polygons".* FROM "polygons"
---
  def index
    @polygons = Polygon.all